interface var10 {

    public double logika(double d1, double d2, double d3);
    // ?аны три числа. Найти остаток от делени§ самого большого на
    // самое маленькое число

    public void poka(double P);
    // Начальный вклад в банке равен 1000 руб. Дерез каждый мес§ц размер
    // вклада увеличиваетс§ в P раз. Њо данному P определить, через сколько
    // мес§цев размер вклада превысит 1100 руб

    public void massivy(double[] A);
    // Њроверить, чередуютс§ ли в массиве A четные и нечетные числа.
    // ?сли чередуютс§, то вывести 0, если нет, то вывести 1.

}
